## Production: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 17 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                           NAME                                                                            |
|--------|-----------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key`                                                                            |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_rule.this`                                        |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_target.this`                                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0]`                                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_repository.this[0]`                                            |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_lambda_permission.this`                                            |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_log_group.this`                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[0]`                         |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[1]`                         |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role.this`                                  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[1]`      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_support_freshdesk_export.data.aws_iam_policy_document.platform_support_freshdesk_export will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_support_freshdesk_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key will be created
  + resource "aws_ssm_parameter" "freshdesk_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/platform/support/freshdesk-api-key"
      + tags_all       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-support-freshdesk-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-support-freshdesk-export-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 day)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "platform-support-freshdesk-export-schedule"
      + target_id      = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 git SHA tagged images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 7 days"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-support-freshdesk-export"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-support-freshdesk-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-support-freshdesk-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/platform-support-freshdesk-export"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/platform-support-freshdesk-export",
        ]
      + name                = "Lambda Statistics / platform-support-freshdesk-export"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-support-freshdesk-export_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-support-freshdesk-export-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-support-freshdesk-export-1"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cds-data-lake-raw-production/platform/support/freshdesk/"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-support-freshdesk-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "platform-support-freshdesk-export"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FRESHDESK_API_KEY_PARAMETER_NAME" = "/platform/support/freshdesk-api-key"
              + "FRESHDESK_DOMAIN"                 = "cds-snc.freshdesk.com"
              + "S3_BUCKET_NAME"                   = "cds-data-lake-raw-production"
              + "S3_OBJECT_PREFIX"                 = "/platform/support/freshdesk/"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
